SET @session_start_value = @@session.rpl_dscp_on_socket;
SELECT @session_start_value;
@session_start_value
0
SET @@session.rpl_dscp_on_socket = 0;
SET @@session.rpl_dscp_on_socket = DEFAULT;
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
0
SET @@session.rpl_dscp_on_socket = 1;
SET @@session.rpl_dscp_on_socket = DEFAULT;
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
0
SET rpl_dscp_on_socket = 1;
SELECT @@rpl_dscp_on_socket;
@@rpl_dscp_on_socket
1
SELECT session.rpl_dscp_on_socket;
ERROR 42S02: Unknown table 'session' in field list
SELECT local.rpl_dscp_on_socket;
ERROR 42S02: Unknown table 'local' in field list
SET session rpl_dscp_on_socket = 0;
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
0
SET @@session.rpl_dscp_on_socket = 0;
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
0
SET @@session.rpl_dscp_on_socket = 1;
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
1
SET @@session.rpl_dscp_on_socket = -1;
Warnings:
Warning	1292	Truncated incorrect rpl_dscp_on_socket value: '-1'
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
0
SET @@session.rpl_dscp_on_socket = 64;
Warnings:
Warning	1292	Truncated incorrect rpl_dscp_on_socket value: '64'
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
63
SET @@session.rpl_dscp_on_socket = "T";
ERROR 42000: Incorrect argument type to variable 'rpl_dscp_on_socket'
SET @@session.rpl_dscp_on_socket = 1000;
Warnings:
Warning	1292	Truncated incorrect rpl_dscp_on_socket value: '1000'
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
63
SET @@global.rpl_dscp_on_socket = 0;
ERROR HY000: Variable 'rpl_dscp_on_socket' is a SESSION variable and can't be used with SET GLOBAL
SELECT @@global.rpl_dscp_on_socket;
ERROR HY000: Variable 'rpl_dscp_on_socket' is a SESSION variable
SELECT count(VARIABLE_VALUE) FROM performance_schema.session_variables
WHERE VARIABLE_NAME='rpl_dscp_on_socket';
count(VARIABLE_VALUE)
1
SET @@session.rpl_dscp_on_socket = OFF;
ERROR 42000: Incorrect argument type to variable 'rpl_dscp_on_socket'
SET @@session.rpl_dscp_on_socket = ON;
ERROR 42000: Incorrect argument type to variable 'rpl_dscp_on_socket'
SET @@session.rpl_dscp_on_socket = @session_start_value;
SELECT @@session.rpl_dscp_on_socket;
@@session.rpl_dscp_on_socket
0
